cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/versions'
tap 'Homebrew/bundle'

brew 'redis', restart_service: true
brew 'imagemagick'
brew 'ack'
brew 'android-sdk'
brew 'libyaml'
brew 'pkg-config'
brew 'openssl'
brew 'coreutils'
brew 'ansible'
brew 'xz'
brew 'binutils'
brew 'findutils'
brew 'flow'
brew 'gcc'
brew 'readline'
brew 'python'
brew 'libxml2'
brew 'postgresql'
brew 'git'
brew 'go'
brew 'heroku-toolbelt'
brew 'hub'
brew 'imagemagick'
brew 'jmeter'
brew 'libssh2'
brew 'libgit2', args: ['with-libssh2']
brew 'libgit2-glib'
brew 'libxslt'
brew 'memcached'
brew 'mr'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'postgis'
brew 'ruby-build'
brew 'rbenv'
brew 'siege'
brew 'ssh-copy-id'
brew 'tree'
brew 'v8'
brew 'vcsh'
brew 'vim', args: ['override-system-vi']
brew 'wakeonlan'
brew 'watchman', args: ['HEAD']
brew 'wget', args: ['with-iri']
brew 'zsh'
brew 'homebrew/versions/phantomjs198'

cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'adobe-reader'
cask 'android-file-transfer'
cask 'bittorrent-sync'
cask 'calibre'
cask 'evernote'
cask 'firefox', args: { appdir: '/Applications' }
cask 'flowdock'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-photos-backup'
cask 'google-drive'
cask 'iterm2'
cask 'jing'
cask 'libreoffice'
cask 'macvim'
cask 'rubymine'
cask 'skype'
cask 'spectacle'
cask 'steam'
cask 'transmission'
cask 'transmission-remote-gui'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'vox'
cask 'slack'
cask 'skitch'
cask 'tunnelblick'
cask 'tunnelbear'
cask 'avast'

#brew 'cabal-install'
#cask '1password'
